garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1614.PIC
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="AT1CON0" edc:desc="" edc:impl="0xf8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0x000-00" edc:name="AT1CON0" edc:nzwidth="8" edc:por="0x000-00" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x814">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1" edc:name="MODE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="APMOD" edc:mask="0x1" edc:name="APMOD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x3" edc:name="PS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PREC" edc:desc="" edc:mask="0x1" edc:name="PREC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1MODE" edc:desc="" edc:mask="0x1" edc:name="AT1MODE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1APMOD" edc:mask="0x1" edc:name="AT1APMOD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AT1POL" edc:desc="" edc:mask="0x1" edc:name="AT1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1PS" edc:desc="" edc:mask="0x3" edc:name="AT1PS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="AT1PREC" edc:desc="" edc:mask="0x1" edc:name="AT1PREC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1EN" edc:desc="" edc:mask="0x1" edc:name="AT1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="AT1PS0" edc:desc="" edc:mask="0x1" edc:name="AT1PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1PS1" edc:desc="" edc:mask="0x1" edc:name="AT1PS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n-n-nrr" edc:cname="AT1CON1" edc:desc="" edc:impl="0x57" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-0-000" edc:name="AT1CON1" edc:nzwidth="8" edc:por="-0-0-000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x815">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VALID" edc:desc="" edc:mask="0x1" edc:name="VALID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACCS" edc:desc="" edc:mask="0x1" edc:name="ACCS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MPP" edc:desc="" edc:mask="0x1" edc:name="MPP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PRP" edc:desc="" edc:mask="0x1" edc:name="PRP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PHP" edc:desc="" edc:mask="0x1" edc:name="PHP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1VALID" edc:desc="" edc:mask="0x1" edc:name="AT1VALID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1ACCS" edc:desc="" edc:mask="0x1" edc:name="AT1ACCS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1MPP" edc:desc="" edc:mask="0x1" edc:name="AT1MPP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AT1PRP" edc:desc="" edc:mask="0x1" edc:name="AT1PRP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AT1PHP" edc:desc="" edc:mask="0x1" edc:name="AT1PHP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1IR0" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1IR0" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x816">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AT1PERIF" edc:desc="" edc:mask="0x1" edc:name="AT1PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1MISSIF" edc:desc="" edc:mask="0x1" edc:name="AT1MISSIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1PHSIF" edc:desc="" edc:mask="0x1" edc:name="AT1PHSIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1IE0" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1IE0" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x817">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AT1PERIE" edc:desc="" edc:mask="0x1" edc:name="AT1PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1MISSIE" edc:desc="" edc:mask="0x1" edc:name="AT1MISSIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1PHSIE" edc:desc="" edc:mask="0x1" edc:name="AT1PHSIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1IR1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1IR1" edc:nzwidth="8" edc:por="-----000" edc:_addr="0x818">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AT1CC1IF" edc:desc="" edc:mask="0x1" edc:name="AT1CC1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC2IF" edc:desc="" edc:mask="0x1" edc:name="AT1CC2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC3IF" edc:desc="" edc:mask="0x1" edc:name="AT1CC3IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
