garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1614.PIC
        <edc:SFRDef edc:access="nnn--rrr" edc:cname="SMT2STAT" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--000" edc:name="SMT2STAT" edc:nzwidth="8" edc:por="000--000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDAC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS" edc:desc="" edc:mask="0x1" edc:name="AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WS" edc:desc="" edc:mask="0x1" edc:name="WS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TS" edc:desc="" edc:mask="0x1" edc:name="TS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RST" edc:desc="" edc:mask="0x1" edc:name="RST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPWUP" edc:desc="" edc:mask="0x1" edc:name="CPWUP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPRUP" edc:desc="" edc:mask="0x1" edc:name="CPRUP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT2AS" edc:desc="" edc:mask="0x1" edc:name="SMT2AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WS" edc:desc="" edc:mask="0x1" edc:name="SMT2WS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2TS" edc:desc="" edc:mask="0x1" edc:name="SMT2TS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SMT2RESET" edc:desc="" edc:mask="0x1" edc:name="SMT2RESET" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2CPWUP" edc:desc="" edc:mask="0x1" edc:name="SMT2CPWUP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2CPRUP" edc:desc="" edc:mask="0x1" edc:name="SMT2CPRUP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SMT2CLK" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SMT2CLK" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDAD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSEL" edc:desc="" edc:mask="0x7" edc:name="CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="" edc:mask="0x1" edc:name="CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="" edc:mask="0x1" edc:name="CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="" edc:mask="0x1" edc:name="CSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT2CSEL" edc:desc="" edc:mask="0x7" edc:name="SMT2CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT2CSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT2CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2CSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT2CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2CSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT2CSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT2SIG" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SMT2SIG" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDAE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSEL" edc:desc="" edc:mask="0x1f" edc:name="SSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSEL0" edc:desc="" edc:mask="0x1" edc:name="SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL1" edc:desc="" edc:mask="0x1" edc:name="SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL2" edc:desc="" edc:mask="0x1" edc:name="SSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL3" edc:mask="0x1" edc:name="SSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSEL4" edc:mask="0x1" edc:name="SSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT2SSEL" edc:desc="" edc:mask="0x1f" edc:name="SMT2SSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT2SSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT2SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2SSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT2SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2SSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT2SSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2SSEL3" edc:mask="0x1" edc:name="SMT2SSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT2SSEL4" edc:mask="0x1" edc:name="SMT2SSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT2WIN" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SMT2WIN" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xDAF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WSEL" edc:desc="" edc:mask="0x1f" edc:name="WSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WSEL0" edc:desc="" edc:mask="0x1" edc:name="WSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL1" edc:desc="" edc:mask="0x1" edc:name="WSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL2" edc:desc="" edc:mask="0x1" edc:name="WSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL3" edc:desc="" edc:mask="0x1" edc:name="WSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL4" edc:mask="0x1" edc:name="WSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT2WSEL" edc:desc="" edc:mask="0x1f" edc:name="SMT2WSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT2WSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT2WSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT2WSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT2WSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WSEL3" edc:desc="" edc:mask="0x1" edc:name="SMT2WSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WSEL4" edc:mask="0x1" edc:name="SMT2WSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe70" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE00"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xE0C"/>
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0xE0F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:desc="" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="INTPPS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="INTPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE10">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTPPS" edc:mask="0x1f" edc:name="INTPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INTPPS0" edc:desc="" edc:mask="0x1" edc:name="INTPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS1" edc:desc="" edc:mask="0x1" edc:name="INTPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS2" edc:desc="" edc:mask="0x1" edc:name="INTPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS3" edc:desc="" edc:mask="0x1" edc:name="INTPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTPPS4" edc:desc="" edc:mask="0x1" edc:name="INTPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
